/*========================================*\
    文件 : mmp.h
    作者 : 陈乐群
\*========================================*/

#ifndef __MMP__
#define __MMP__

/*========================================*\
    功能 : 创建内存池
    参数 : (输入)内存池尺寸
    返回 : (成功)0
           (失败)-1
\*========================================*/
int fmmpInit(int size);
/*========================================*\
    功能 : 删除内存池
    参数 : 空
    返回 : (成功)0
           (失败)-1
\*========================================*/
int fmmpFree(void);
/*========================================*\
    功能 : 重置内存池
    参数 : (输入)内存池尺寸
    返回 : (成功)0
           (失败)-1
\*========================================*/
int fmmpRnit(int size);
/*========================================*\
    功能 : 切换内存池
    参数 : (输入)新内存池指针
           (输出)原内存池指针
    返回 : 空
\*========================================*/
void fmmpSwap(void *new,void **old);

/*========================================*\
    功能 : 设置内存池拷贝
    参数 : (输入)内存池名称
           (输入)内存池序号
           (输入)内存池拷贝
           (输入)内存池尺寸
    返回 : (成功)0
           (失败)-1
\*========================================*/
int fmmpValSet(char *mark,int index,void *data,int size);
/*========================================*\
    功能 : 获取内存池拷贝
    参数 : (输入)内存池名称
           (输入)内存池序号
           (输出)内存池拷贝
           (输出)内存池尺寸
    返回 : (成功)0
           (失败)-1
\*========================================*/
int fmmpValGet(char *mark,int index,void *data,int *size);

/*========================================*\
    功能 : 设置内存池引用
    参数 : (输入)内存池名称
           (输入)内存池序号
           (输入)内存池引用
           (输入)内存池尺寸
    返回 : (成功)0
           (失败)-1
\*========================================*/
int fmmpRefSet(char *mark,int index,void *data,int size);
/*========================================*\
    功能 : 获取内存池引用
    参数 : (输入)内存池名称
           (输入)内存池序号
           (输出)内存池引用
           (输出)内存池尺寸
    返回 : (成功)0
           (失败)-1
\*========================================*/
int fmmpRefGet(char *mark,int index,void *data,int *size);

#endif
