/*========================================*\
    文件 : jsn.h
    作者 : 陈乐群
\*========================================*/

#ifndef __JSN__
#define __JSN__

struct tjsnItem
{
	char type;
	struct tjsnItem *chld;
	struct tjsnItem *next;
	char *keyd;
	int keyl;
	char *vald;
	int vall;
};

/*========================================*\
    功能 : 数据结构节点分配
    参数 : (输出)数据结构节点
    返回 : (成功)0
           (失败)-1
\*========================================*/
int fjsnInit(struct tjsnItem **item);
/*========================================*\
    功能 : 数据结构节点释放
    参数 : (输入)数据结构节点
    返回 : 空
\*========================================*/
void fjsnFree(struct tjsnItem *item);

/*========================================*\
    功能 : 创建字符类型节点
    参数 : (输出)数据结构节点
           (输入)键数据
           (输入)键长度
           (输入)值数据
           (输入)值长度
    返回 : (成功)0
           (失败)-1
\*========================================*/
int fjsnStrCreate(struct tjsnItem **item,char *keyd,int keyl,char *vald,int vall);
/*========================================*\
    功能 : 创建数值类型节点
    参数 : (输出)数据结构节点
           (输入)键数据
           (输入)键长度
           (输入)值数据
           (输入)值长度
    返回 : (成功)0
           (失败)-1
\*========================================*/
int fjsnNumCreate(struct tjsnItem **item,char *keyd,int keyl,char *vald,int vall);
/*========================================*\
    功能 : 创建数组类型节点
    参数 : (输出)数据结构节点
           (输入)键数据
           (输入)键长度
    返回 : (成功)0
           (失败)-1
\*========================================*/
int fjsnArrCreate(struct tjsnItem **item,char *keyd,int keyl);
/*========================================*\
    功能 : 创建对象类型节点
    参数 : (输出)数据结构节点
           (输入)键数据
           (输入)键长度
    返回 : (成功)0
           (失败)-1
\*========================================*/
int fjsnObjCreate(struct tjsnItem **item,char *keyd,int keyl);

/*========================================*\
    功能 : 插入数组类型节点
    参数 : (输入)数组节点
           (输入)插入节点
    返回 : 空
\*========================================*/
void fjsnArrInsert(struct tjsnItem *arr,struct tjsnItem *item);
/*========================================*\
    功能 : 插入对象类型节点
    参数 : (输入)对象节点
           (输入)插入节点
    返回 : 空
\*========================================*/
void fjsnObjInsert(struct tjsnItem *obj,struct tjsnItem *item);

/*========================================*\
    功能 : 查询数组类型节点
    参数 : (输入)数组节点
           (输出)查询节点
           (输入)序
    返回 : (成功)0
           (失败)-1
\*========================================*/
int fjsnArrSelect(struct tjsnItem *arr,struct tjsnItem **item,int ind);
/*========================================*\
    功能 : 查询对象类型节点
    参数 : (输入)对象节点
           (输出)查询节点
           (输入)键数据
           (输入)键长度
    返回 : (成功)0
           (失败)-1
\*========================================*/
int fjsnObjSelect(struct tjsnItem *obj,struct tjsnItem **item,char *keyd,int keyl);

/*========================================*\
    功能 : 将数据结构导出到报文
    参数 : (输入)数据结构节点
           (输出)报文数据
           (输出)报文长度
    返回 : (成功)0
           (失败)-1
\*========================================*/
int fjsnExport(struct tjsnItem *item,char **pd,int *pl);
/*========================================*\
    功能 : 将报文导入到数据结构
    参数 : (输出)数据结构节点
           (出入)报文数据
           (输入)报文长度
    返回 : (成功)0
           (失败)-1
\*========================================*/
int fjsnImport(struct tjsnItem *item,char **pd,int pl);

#endif
