/*========================================*\
    文件 : pkg.h
    作者 : 陈乐群
\*========================================*/

#ifndef __PKG__
#define __PKG__

//交换报文数据.
#define mpkgSwap(fmldata,tmpdata)\
{                                \
	char *temp;                  \
	temp=fmldata;                \
	fmldata=tmpdata;             \
	tmpdata=temp;                \
}

/*========================================*\
    功能 : 创建报文规则
    参数 : (输入)业务代码
    返回 : (成功)0
           (失败)-1
\*========================================*/
int fpkgRuleInit(char *bsncode);

/*========================================*\
    功能 : 报文编码
    参数 : (输入)渠道代码
           (输入)交易代码
           (出入)正式报文数据
           (出入)临时报文数据
           (输出)报文长度
    返回 : (成功)0
           (失败)-1
\*========================================*/
int fpkgEnc(char *lnkcode,char *trncode,char **fmldata,char **tmpdata,int *size);
/*========================================*\
    功能 : 报文解码
    参数 : (输入)渠道代码
           (输入)交易代码
           (出入)正式报文数据
           (出入)临时报文数据
           (输入)报文长度
    返回 : (成功)0
           (失败)-1
\*========================================*/
int fpkgDec(char *lnkcode,char *trncode,char **fmldata,char **tmpdata,int size);

/*========================================*\
    功能 : 字符编码转换
    参数 : (出入)正式报文数据
           (出入)临时报文数据
           (输入)报文长度
           (输入)来源字符集
                 目的字符集
    返回 : (成功)0
           (失败)-1
\*========================================*/
int fpkgSetEnc(char **fmldata,char **tmpdata,int *size,char *argument);

/*========================================*\
    功能 : URL转换编码
    参数 : (出入)正式报文数据
           (出入)临时报文数据
           (输入)报文长度
           (输入)大写(upper)/小写(lower)
    返回 : (成功)0
           (失败)-1
\*========================================*/
int fpkgUrlEnc(char **fmldata,char **tmpdata,int *size,char *argument);
/*========================================*\
    功能 : URL转换解码
    参数 : (出入)正式报文数据
           (出入)临时报文数据
           (输入)报文长度
           (输入)大写(upper)/小写(lower)
    返回 : (成功)0
           (失败)-1
\*========================================*/
int fpkgUrlDec(char **fmldata,char **tmpdata,int *size,char *argument);

/*========================================*\
    功能 : 十六进制转换编码
    参数 : (出入)正式报文数据
           (出入)临时报文数据
           (输入)报文长度
           (输入)大写(upper)/小写(lower)
    返回 : (成功)0
           (失败)-1
\*========================================*/
int fpkgHexEnc(char **fmldata,char **tmpdata,int *size,char *argument);
/*========================================*\
    功能 : 十六进制转换解码
    参数 : (出入)正式报文数据
           (出入)临时报文数据
           (输入)报文长度
           (输入)大写(upper)/小写(lower)
    返回 : (成功)0
           (失败)-1
\*========================================*/
int fpkgHexDec(char **fmldata,char **tmpdata,int *size,char *argument);

/*========================================*\
    功能 : BASE64算法编码
    参数 : (出入)正式报文数据
           (出入)临时报文数据
           (输入)报文长度
           (输入)无
    返回 : (成功)0
           (失败)-1
\*========================================*/
int fpkgB64Enc(char **fmldata,char **tmpdata,int *size,char *argument);
/*========================================*\
    功能 : BASE64算法解码
    参数 : (出入)正式报文数据
           (出入)临时报文数据
           (输入)报文长度
           (输入)无
    返回 : (成功)0
           (失败)-1
\*========================================*/
int fpkgB64Dec(char **fmldata,char **tmpdata,int *size,char *argument);

/*========================================*\
    功能 : 信息摘要算法
    参数 : (出入)正式报文数据
           (出入)临时报文数据
           (输入)报文长度
           (输入)算法
    返回 : (成功)0
           (失败)-1
\*========================================*/
int fpkgDigEnc(char **fmldata,char **tmpdata,int *size,char *argument);

/*========================================*\
    功能 : 对称加密算法加密
    参数 : (出入)正式报文数据
           (出入)临时报文数据
           (输入)报文长度
           (输入)算法
                 密钥
                 向量
                 填充模式
    返回 : (成功)0
           (失败)-1
\*========================================*/
int fpkgCipEnc(char **fmldata,char **tmpdata,int *size,char *argument);
/*========================================*\
    功能 : 对称加密算法解密
    参数 : (出入)正式报文数据
           (出入)临时报文数据
           (输入)报文长度
           (输入)算法
                 密钥
                 向量
                 填充模式
    返回 : (成功)0
           (失败)-1
\*========================================*/
int fpkgCipDec(char **fmldata,char **tmpdata,int *size,char *argument);

/*========================================*\
    功能 : RSA算法加密
    参数 : (出入)正式报文数据
           (出入)临时报文数据
           (输入)报文长度
           (输入)E键
                 N键
                 D键
                 密钥类型
                 填充模式
    返回 : (成功)0
           (失败)-1
\*========================================*/
int fpkgRsaEnc(char **fmldata,char **tmpdata,int *size,char *argument);
/*========================================*\
    功能 : RSA算法解密
    参数 : (出入)正式报文数据
           (出入)临时报文数据
           (输入)报文长度
           (输入)E键
                 N键
                 D键
                 密钥类型
                 填充模式
    返回 : (成功)0
           (失败)-1
\*========================================*/
int fpkgRsaDec(char **fmldata,char **tmpdata,int *size,char *argument);

#endif
