/*========================================*\
    文件 : xml.h
    作者 : 陈乐群
\*========================================*/

#ifndef __XML__
#define __XML__

struct txmlItem
{
	char type;
	struct txmlItem *chld;
	struct txmlItem *next;
	char *keyd;
	int keyl;
	char *vald;
	int vall;
};

/*========================================*\
    功能 : 数据结构节点分配
    参数 : (输出)数据结构节点
    返回 : (成功)0
           (失败)-1
\*========================================*/
int fxmlInit(struct txmlItem **item);
/*========================================*\
    功能 : 数据结构节点释放
    参数 : (输入)数据结构节点
    返回 : 空
\*========================================*/
void fxmlFree(struct txmlItem *item);

/*========================================*\
    功能 : 创建字符类型节点
    参数 : (输出)数据结构节点
           (输入)值数据
           (输入)值长度
    返回 : (成功)0
           (失败)-1
\*========================================*/
int fxmlStrCreate(struct txmlItem **item,char *vald,int vall);
/*========================================*\
    功能 : 创建数值类型节点
    参数 : (输出)数据结构节点
           (输入)值数据
           (输入)值长度
    返回 : (成功)0
           (失败)-1
\*========================================*/
int fxmlNumCreate(struct txmlItem **item,char *vald,int vall);
/*========================================*\
    功能 : 创建数组类型节点
    参数 : (输出)数据结构节点
    返回 : (成功)0
           (失败)-1
\*========================================*/
int fxmlArrCreate(struct txmlItem **item);
/*========================================*\
    功能 : 创建对象类型节点
    参数 : (输出)数据结构节点
    返回 : (成功)0
           (失败)-1
\*========================================*/
int fxmlObjCreate(struct txmlItem **item);

/*========================================*\
    功能 : 插入对象类型节点
    参数 : (输入)对象节点
           (输入)插入节点
           (输入)键数据
           (输入)键长度
    返回 : 空
\*========================================*/
void fxmlObjInsert(struct txmlItem *obj,struct txmlItem *item,char *keyd,int keyl);

/*========================================*\
    功能 : 查询对象类型节点
    参数 : (输入)对象节点
           (输出)查询节点
           (输入)键数据
           (输入)键长度
    返回 : (成功)0
           (失败)-1
\*========================================*/
int fxmlObjSelect(struct txmlItem *obj,struct txmlItem **item,char *keyd,int keyl);

/*========================================*\
    功能 : 将数据结构导出到报文
    参数 : (输入)数据结构节点
           (输出)报文数据
           (输出)报文长度
    返回 : (成功)0
           (失败)-1
\*========================================*/
int fxmlExport(struct txmlItem *item,char **pd,int *pl);
/*========================================*\
    功能 : 将报文导入到数据结构
    参数 : (输出)数据结构节点
           (出入)报文数据
           (输入)报文长度
    返回 : (成功)0
           (失败)-1
\*========================================*/
int fxmlImport(struct txmlItem *item,char **pd,int pl);

#endif
