/*========================================*\
    文件 : dbs.h
    作者 : 陈乐群
\*========================================*/

#ifndef __DBS__
#define __DBS__

/*========================================*\
    功能 : 连接数据库
    参数 : (输入)业务代码
    返回 : (成功)0
           (失败)-1
\*========================================*/
int fdbsInit(char *bsncode);
/*========================================*\
    功能 : 断开数据库
    参数 : 空
    返回 : (成功)0
           (失败)-1
\*========================================*/
int fdbsFree(void);

/*========================================*\
    功能 : 数据库管理
    参数 : (输入)语句格式
    返回 : (成功)0
           (失败)-1
\*========================================*/
int fdbsManage(char *format,...);

/*========================================*\
    功能 : 数据库查询预备
    参数 : (出入)语句句柄
           (输入)语句格式
    返回 : (成功)0
           (失败)-1
\*========================================*/
int fdbsSelectInit(void **stm,char *format,...);
/*========================================*\
    功能 : 数据库查询绑定
    参数 : (输入)语句句柄
           (输入)数据序号
           (输入)数据类型
           (输入)数据空间
           (输入)数据尺寸
    返回 : (成功)0
           (失败)-1
\*========================================*/
int fdbsSelectBind(void *stm,int index,int type,void *data,int size);
/*========================================*\
    功能 : 数据库查询提取
    参数 : (输入)语句句柄
    返回 : (成功)0
           (失败)-1
\*========================================*/
int fdbsSelectGain(void *stm);
/*========================================*\
    功能 : 数据库查询结束
    参数 : (输入)语句句柄
    返回 : 空
\*========================================*/
int fdbsSelectFree(void *stm);

//数据库查询绑定SHT类型.
#define mdbsSelectBindSht(stm,index,data,size) fdbsSelectBind(stm,index,5,data,size)
//数据库查询绑定INT类型.
#define mdbsSelectBindInt(stm,index,data,size) fdbsSelectBind(stm,index,4,data,size)
//数据库查询绑定DBL类型.
#define mdbsSelectBindDbl(stm,index,data,size) fdbsSelectBind(stm,index,8,data,size)
//数据库查询绑定STR类型.
#define mdbsSelectBindStr(stm,index,data,size) fdbsSelectBind(stm,index,1,data,size)

/*========================================*\
    功能 : 数据库事务开始
    参数 : 空
    返回 : (成功)0
           (失败)-1
\*========================================*/
int fdbsTran(void);
/*========================================*\
    功能 : 数据库事务提交
    参数 : 空
    返回 : (成功)0
           (失败)-1
\*========================================*/
int fdbsComm(void);
/*========================================*\
    功能 : 数据库事务回滚
    参数 : 空
    返回 : (成功)0
           (失败)-1
\*========================================*/
int fdbsRoll(void);

#endif
